[
  {
    "subreddit": "sex",
    "human": {
      "title": "My SO and I have pretty much stopped having sex for over a year. I don't know how I feel about it.",
      "text": "Edit: sorry I haven't replied to most comments, I didn't have the time to check my phone. Thanks to everyone for the advice, good or bad. \n\nWe've been together for 6 years. Our relationship has honestly always been bumpy. Idk where it's going to go eventually but we're in a better place now than before. \n\nHe has always had much lower sex drive than me, which was a problem and we constantly had to talk about it over and over, and honestly never got to a conclusion as to why he didn't want to have sex with me very often.\n\nWe had a really bad fight a couple of years ago and my trust was broken so for the first time, I was the one who didn't want to have sex. I needed space and distance from him and I couldn't even think of sex at the time. It took a long time for me to get some of the trust back. But at that point we'd already settled into a sort of comfortable place with just... Not having sex at all. It was weird to initiate and it just didn't feel the same because we weren't used to th"
    },
    "ai": {
      "title": "[Question] Is it weird if my woman has sex with a friend/boyfriend/ex-boyfriend and doesn't tell me about it?",
      "text": "I (18M) was talking with my friend (20F) and she says that she and my girl (18F) have sex with their old boyfriends/friends etc.\n\nIn my opinion it's totally fine as long as they don't tell me."
    }
  },
  {
    "subreddit": "confession",
    "human": {
      "title": "I stole books from a charity and then threw them away",
      "text": "This post is inspired from the post a guy made about needlessly stealing books from Barnes and Noble. What I did wasn't the same but similar. \n\nA couple years ago I was in a Christian men's adult rehab. It worked like Job Corps. We all lived in an apartment building. We worked 45 hours a week at the nearby thrift store ran by the charity. This is the same charity that has people ringing bells around christmastime for donations. \n\nIt was a strictly ran place. We had to shave every morning, had to have a collared shirt tucked in when not in our room, had to attend church twice a week and participate as well as look happy. The people that ran the place believed that we could all better ourselves if Jesus was involved with every part of our life. That also meant the media we consumed. The television we watched had to be PG or Christian related. And the same went for books. They had a \"library\" which was one measly bookshelf and it only contained God themed self help books. \n\nThis was no go"
    },
    "ai": {
      "title": "I'm a huge fucking loser",
      "text": "[No Regrets]\n\nI'm a 20 year old guy, and I'm a fucking loser. I'm living a shitty life. I used to have a good family, but they don't have the resources to help me. I don't have a fucking car. My only friends are my parents and my sister. Even if I didn't have anyone to talk to I still wouldn't make much of an attempt to get good grades. I'm stuck in a dead end job, and I'm trying to get a better job, but I'm too dumb, and I'm too poor, to make it. I have no friends. I'm too shy to ask girls out. I work a dead end job. I don't have time to talk much. I work on my grades. I make myself happy. I try to make my family happy. I try to keep my relationships with my friends. I try to get good grades. I try to be the best person I can.  But I'm just a loser. I'm a fucking loser."
    }
  },
  {
    "subreddit": "copypasta",
    "human": {
      "title": "god asked me if I wanted to beta test meth 2 and I said yes | S1 EP1: new home",
      "text": "Peppa pig and her family arrive to their new home in Florida after their old house was shelled to oblivion by the Austro-Hungarians during ww1 .the arrive to their new house and their new neighbors immediately introduce themselves , Samuel Rodriguez and Light Yagami. After Peppa and her family unload their 13 kilograms of crystal meth into their house , they start exploring to get familiar to their family . whey are also packing 20 pounds of explosives incase someone breathes slightly wrong because why not. while they are strolling through the park , george pig finds some bugs that he can brutally torture and kill, so he keeps them in his cum sock for safe keeping. after that daddy pig then procedes to shoot-up a local school but its okay because he was wearing a mask . while they are exploring they also meet the state senator , quadingle dingle. Daddy pig and quadingle dingle have a nice conversation about the social economics of the state , conversation highlights:\n\n(DP = daddy pig) "
    },
    "ai": {
      "title": "i am the strongest",
      "text": "i am the strongest. you think you can go up against me? you will just get a fucking punch in the face, your legs will be all jello, and you will be out of my house in less than a minute. you don't know what you are dealing with here, kid. you aren't the strongest. you aren't the strongest."
    }
  },
  {
    "subreddit": "askhistorians",
    "human": {
      "title": "Historians of Reddit: What did a ‘medieval’ port look like?",
      "text": "First off, a disclaimer: ‘Medieval’ is a bit of stretch because we can go up to 17th century Golden Era Antwerp as inspiration.\n\nI want to make a small port/harbour town for D&D. Instead of just going at it, I’d like to have a better understanding of what makes a port or harbour.\n\nThis lead to questions like:\n- Is there a typical layout for the infrastructures?\n(“Building A would generally be built close to building B.” or “Building X would generally not be close to the water.”)\n- Which structures or buildings are deemed ‘essential’?\n- etc…\n\nI’m mostly looking for sources like maps or historical paintings, but (architectural) documentation or (personal) insights are definitely welcome as well!\n\nMany thanks!"
    },
    "ai": {
      "title": "What did the British and French do during WWII to try to take back their colonies from the Germans?",
      "text": "So, basically, after the Germans had occupied most of Europe, the British and French decided that the only way to fight back was to take back their colonies, since Germany had essentially crushed them and killed off any resistance. \n\nObviously, this is a very complicated topic, so I'm looking for a more concise answer than the one I got from /u\\/The_Dowling."
    }
  },
  {
    "subreddit": "confession",
    "human": {
      "title": "In Grade 3, I poured cement into someone’s open car window because I was dared to.",
      "text": "My friend dared me to and he had a bucket of what I assume was cement outside his house. He kept pressuring me saying it’ll be funny and not to be a wimp. I felt so bad for weeks my stomach would hurt. I went back the best day and the window was closed and it looks like it was cleaned somewhat. My friend then blackmailed me saying if I didn’t give him my cafeteria cookies (they were amazing) he’s tell on me. I gave in for a few weeks until one day I just didn’t and nothing happened of course. I deeply regret doing this. Fuck you daniel you skeet"
    },
    "ai": {
      "title": "I hate myself and the world.",
      "text": "I'm a 24 year old male.\n\nI went to college, and I hated it. I didn't really have a passion for anything. I wasn't the most socially active, and I was a social outcast. I didn't like it. I'm also a single father.\n\nI'm not a bad person by any means. I'm a very loving caring person. I don't hate anyone. There are some people I don't like, but I'm the kind of person that doesn't really care what they think. I feel like an asshole sometimes, and I do sometimes get angry and have to get it out. I hate myself. I'm a piece of shit."
    }
  },
  {
    "subreddit": "conlangs",
    "human": {
      "title": "ITEOAN (In The Eyes Of a Native)",
      "text": "Hello fellow conlangers!\n\nBasically, the prompt is:\n\nHow would your fictional native speakers of your conlang describe their language? Like how would they describe noun cases or polysynthesis? Their phonology? How would they describe the concept of vowels and consonants? Their script?\n\nEx. \n\nZemeren (My WIP conlang)\n\nOur language is written with the Hebrew script, where we don't write 'open sounds' (what we earthlings call vowels). We have 2 ways on how to end an action word (aka a verb) depending on the action word itself. Our nouns have 6 patterns of ending sounds (you get the gist now) depending on the word.\n\nHope this helps us discover each other's conlangs.\nAnd cheers to 78500 members!"
    },
    "ai": {
      "title": "Does your conlang have a \"pro\" prefix?",
      "text": "I have a conlang that has both the prefix **e** and the prefix **ei**, but only the former is used in compounds. Is there any other prefixes or prefixes that are just used in compounds, but aren't prefixes. This is especially interesting because the latter is a much more common word than the former, and they are more common in natural languages."
    }
  },
  {
    "subreddit": "paranormal",
    "human": {
      "title": "My Cat's Afterlife Communication",
      "text": "I lost my dearest cat, Oliver, who was my pet for 8 years. It was painful to know while I was holding his hand and I know that he is going to go.\n\nAfter the news of his passing, I opened the \"Ghost Radar\" app just to try it out or to grasp straws.\n\nAfter a few minutes, the first word came.\n\n\"Cat\"\n\nI bawled my eyes out.\n\n\"Weak\"\n\n\"Mama\"\n\nThen the radar never responded after the last word. I was not sure, is it my cat responding to me? Where do cats go when they die? I read that they do not go either to hell nor heaven because they do not have a sense of right or wrong, and they just travel to the spirit realm.\n\nI am still at grief of his loss.\n\nI tried to open the radar once more, 7pm.\nI asked where he was and the response was\n\n\"shoe\"\n\nNow we have a shoe rack tower here where my other cats usually hide or lie down to relax.\n\nWhat do you think?"
    },
    "ai": {
      "title": "This is the beginning of another one of these...",
      "text": "So my roommate and I have been having trouble with our apartment. We have been having a lot of \"ghost\" problems around the apartment. The main problem is with the laundry room. The upstairs neighbors and some family members have complained about being woken up by lights and voices. We decided to stop using that laundry room as a space for our laundry. (I know, I know, but I'm tired and it's easier to just not use the laundry room than to go and do it) Well, we've had a lot of weird things happen in the laundry room. We've seen figures, voices, and have even had objects fly off the counters to the ceiling. \n\nFor about a month now, I've been hearing a loud, eerie, deep, demonic sounding voice. It's the kind of voice that would sound like a demon. I know that sound because I've heard it before, but we still can't figure it out. I'm not sure if it was a ghost, or if it was the laundry room just being \"the devil\" (we call it that) because it's so hard to describe. \n\nThe thing that I find in"
    }
  },
  {
    "subreddit": "math",
    "human": {
      "title": "Math idea/concept you THOUGHT you invented?",
      "text": "Whats an idea or concept from mathematics that you thought you had invented? For me, after my second calculus class, I thought that maybe the entire euclidean plane could be the surface of an infinitely large sphere. Or similarly for the real line. Come second year of college only to find out about these little things called manifolds lol. It was a cool experience though to see how I was able to make a connection to a more advanced idea at the time. \n\nI'm really interested to hear if anyone else has had a similar experience and with what. What did you think you had discovered?"
    },
    "ai": {
      "title": "I'm working through Fermat's Last Theorem, and it seems like no matter how far I progress in the book, I still have to take a number theory class.",
      "text": "But the thing is, even though the book only gives a few basic examples, the most important one is the one on Fermat's Last Theorem, which is covered at length.  I just don't see how I can take a number theory class, but not cover the most important question in the book.\n\nI guess I'm just confused, and I want to ask you more about this.  I did try to google it, but I couldn't find anything."
    }
  },
  {
    "subreddit": "tipofmytongue",
    "human": {
      "title": "[TOMT][word] Journalism: the word for leaving out verbs in sentences",
      "text": "example:\n\n- Police [are] searching for the suspect\n- Drivers [are] baffled about the new traffic signage\n- Congress [is] debating a tax holiday\n- Suspect [is] seen on camera defacing campaign signs\n\nabout 15 years ago (was when I first noticed) reporters started talking like this, leaving out the words above that I put in [ ] . I'm not really sure about newspapers, because headlines are always limited by space. But maybe the same term applies to them too. \n\nHonestly I don't even know if there's a word for this. Personally I dont like it, but I need to know what it's called first so I can research it more. Thanks in advance if you know!"
    },
    "ai": {
      "title": "[TOMT] [Song] Song from the beginning that sounds like this",
      "text": "https://www.youtube.com/watch?v=NX0_ZD0z2BQ\n\nIt's a song from the beginning, but I can't remember the title, or even if it's from a movie or tv show. \n\nFor some reason I think it's from a movie or TV show, but I have no idea. I'm sure there are similar songs from either movies or shows with these themes. I just want to know if there's a movie or TV show that has a song like this. \n\nThank you."
    }
  },
  {
    "subreddit": "prorevenge",
    "human": {
      "title": "New ownership takes over and guy goes on vacation for two years due to stupid new rules.",
      "text": "A family friend was working at the same company, since he was 26, up to when he was 64, when the below started. (I did get his approval to re-tell the story, just not include anything specific, so I am keeping it anonymous and quite general on the specific details.)\n\nPart of the problem, was the laws in the country increasing the retirement age from 62 to 65 when he was in his early-mid fifties, and then again from 65 to 67 when he was about 62-63.\n\nThe old owners were a family and run the bussiness with benefits to the employees.\n\nFrom everything I have heard, I think they were giving an extra vacation week after every 6 years at the company. So ontop of the standard 4 weeks, he had an extra 6 weeks at the time of the events. Also people had access to two weeks of working home office, when the job allowed them to or an extra week off, for those that couldnt use it. So he was getting 11 weeks off each year.\n\nAs a bonus, the family owners were allowing people above 55 to use their vacat"
    },
    "ai": {
      "title": "Fuck you, Mom.",
      "text": "This all happened a month ago on a Saturday night. \n\n I was playing some arcade (F-Zero?) on my phone. I was playing a game, and my mother was watching some porn on the tv. She was playing a few games on my PC. It was late at night and I was playing. I have a habit of playing video games in my room while watching porn on my phone. My mom and I were having sex, and she was watching. I was playing the game.\n\nSo, I didn't notice her looking at my pc, and she came out of the bathroom. I didn't say anything because I was focused on the game, and she had gone and she came in. She sat down in the living room and started watching porn. I just thought she was watching a movie or something. I was playing with my phone and I was about to play a game. She came to look at me, and I was playing F-Zero. So she asked me if I was playing on my phone. I said no and she said \"do you think you could play it on the PC?\" I said yeah and she said \"okay I'm going to go to bed now, I'll be back tomorrow\".\n\nShe"
    }
  },
  {
    "subreddit": "asoiaf",
    "human": {
      "title": "(Spoilers ADWD) George finally wrote a good sex scene towards the end of book 5.",
      "text": "A post on a lighter note. A common criticism I see of George's writing in ASOIAF is his inability to write good sex scenes. This is a criticism that is targeted towards most fantasy writers. Since sex is a somewhat significant part of his books, I can see people dwell on the quality of the writing in those scenes rather than just moving on if they were a rarity.\n\nI personally, am indifferent to sex scenes. Just like scenes of eating food or fighting scenes, it depends on if the writing is good enough and whether there is purpose to the scene. For the scenes in ASOIAF, I never really cared much for any of them but neither was I affected by them. Either they were blandly written or that George used to add these terms like fat, pink mast or Myrish swamp, which made the whole thing really funny.\n\nThe scene I am referring to is in Daenerys VII where Dany is about to wed Hizdahr. The night before the wedding, she spends it with Daario for one final time. George keeps it short, just one para:"
    },
    "ai": {
      "title": "(Spoilers All) I don't get the Iron Price thing.",
      "text": "So here's the issue, I don't really get it. Why is Melisandre and the others buying up all the Targaryen's slaves? Why do they need to do so? What benefits does it bring them? Or do they just buy as many slaves as they can to feed to the fires? I don't see how the Iron Price thing is going to bring in any more slaves. The best way to ensure that the Targaryens can't afford to pay such high prices for slaves is to have them be so far away from the Iron Islands and their lands, that they can't even afford to pay the iron price. \n\nIt seems like there's more to this than meets the eye.\n\nWhat do you guys think?"
    }
  },
  {
    "subreddit": "sex",
    "human": {
      "title": "Finger banging: it’s hotter than given credit for",
      "text": "Nothing like a good finger bang. 2 fingers deep, “come hither” motion on her g-spot. Other hand on her belly and pubic bone, gently pushing down with a little bit of weight, applying constant pressure. Her pussy starts talking, more and more, the wetter she gets. Legs go back. Head goes back. Bites her lip. Her asshole starts to spasm and push out. Her pussy tightens and gives out. She grabs the sheets, arches her back. “I’m cumming.” \n\nAgree? Disagree? What other sex acts aren’t given their due?"
    },
    "ai": {
      "title": "[Porn] Is there a site with porn videos that is not on Netflix?",
      "text": "I'm looking for a site that has videos for \"real sex\" - not \"fake sex\" - and that you can get through my browser."
    }
  },
  {
    "subreddit": "askhistorians",
    "human": {
      "title": "Where did popular American media's portrayal of Mayors wearing a sash come from?",
      "text": "From McDonaldland, The Simpsons, and Powerpuff girls the mayors all wear a sash that say mayor, yet I doubt few of us has seen this in real life. Where did this portrayal come from?"
    },
    "ai": {
      "title": "Is there any evidence that the US Army ever had or used \"suicide troops\"?",
      "text": "I read an article stating that the Army used suicidal troops in WW1, but I can't find it."
    }
  },
  {
    "subreddit": "tipofmytongue",
    "human": {
      "title": "[TOMT] [Comedy] Character comes out of the opticians wearing new ‘glasses’ they’re the strange frame things the optician uses to work out your prescription.",
      "text": "I think the character is a bit of an odd sort, it’s likely British and I think it’s on the older side"
    },
    "ai": {
      "title": "[TOMT] Game/gameplay trailer for a game.",
      "text": "The trailer is from a game. From what I recall the game takes place in the future and the player is in a space ship flying around in a large open level and you are able to choose to be a space marine or marine. Also in the trailer the player can be able to get into a small craft and explore the small planet they're on.\nI remember it was a game that was probably in the next year or so."
    }
  },
  {
    "subreddit": "chess",
    "human": {
      "title": "TIL: Young Alireza Firouzja was auto-banned on chess.com because he was deemed too successful for an untitled player.",
      "text": "This was when he was 11. chess.com algorithms decided he must be cheating to rise in rank so quickly, being an unknown. He was cleared after a manual review of course. Apparently a lot of GMs also flagged his account for cheating.\n\nSource: chess.com interview after 9th round after his >!win!< against Rapport."
    },
    "ai": {
      "title": "Does anyone know of a good site that displays the number of times a chess player has played a particular opening?",
      "text": "I know FICS does this, but it's only for the most recent games.\n\nI'd love to see a site that shows you how many times a player has played the opening they're currently playing.\n\nThanks."
    }
  },
  {
    "subreddit": "drugs",
    "human": {
      "title": "How does injecting improperly balanced liquids w/ the user's DOC not kill them on the spot?",
      "text": "How do heroin users not die from injecting improperly balanced liquids into the bloodstream?\n\nSo I dropped out of biology college and forgot what word I'm looking for here but this came to me last night and I am curious. There might be some major info that I'm missing and I'm trying not to seem like a totally naive dumbshit.\n\nI learned that any aqueous substance injected into the bloodstream needed to be balanced with the salt in the blood in order to keep the red blood cells from rupturing (I think saline solution is .9% salt?).Yet I've heard of heroin users injecting dishwater and orange juice into their veins just as a vehicle for the substance. How does this alone not kill them? It's not like users tend to have bottles of saline solution around the house or wherever it is they're shooting up.\n\nTIA!"
    },
    "ai": {
      "title": "Just a quick question about Xanax and alcohol",
      "text": "I tried xanax to help with sleep and it made me really sad so I'm going to take some alcohol to make me feel better. I'm not sure if I should only drink water or if I should also take some Xanax to help with the booze. How much alcohol should I drink to get the same effect? Should I stop after 1/2 of an hour?"
    }
  },
  {
    "subreddit": "math",
    "human": {
      "title": "I don’t know where to post this but I’m really happy about my math journey at the moment.",
      "text": "Hi everyone, I’ll be headed to university this fall and decided that I needed to brush up on my math skills (I will be taking Calculus I). I was not really strong in mathematics, just average after sophomore year and coupled with a bit of a mental block I didn’t feel the need to try. I realized that my life is in control and math is what I make out of it and I’m starting to fall in love with it as I once did. I woke up at 8 am and have been working on some fundamentals that I’ve been lacking and stopped at around 4 pm. \n\nI just couldn’t stop myself from going, it didn’t feel like a chore and it felt like I was happy to learn. Although I will be reviewing junior and senior year i am quite excited to continue!"
    },
    "ai": {
      "title": "Help with linear algebra",
      "text": "I'm a freshman, and we're studying linear algebra in our first course right now. I'm struggling with the linear algebra portion of the class, and I'm having a hard time memorizing the definitions. I'm also worried that by memorizing the definitions, I'll lose my interest in the subject, and I may even quit. Anyone have suggestions on how to memorize these definitions? Thanks in advance."
    }
  },
  {
    "subreddit": "relationships",
    "human": {
      "title": "My girlfriend (29F) and I (30M) had our first real fight and recovered, however she hasn’t mentioned our previous plans for the 4th since. Should I ask about it? I’m so scared to ask for what I want because I’m scared of “no”",
      "text": "\nMy girlfriend (29F) and I (30M) had our first serious fight two weeks ago (we’ve been together for 7 months almost 8). I won’t get into those details, but it ended up with us taking space for a week. We both came back to each other after a week sorry and willing to work on our relationship. We spoke about how it matters to us, and other positive things. We’re talking daily and spent the entire weekend together. She is skeptical to have sex again as she wants to take things slow and get this right. I understand and I am all on board with being patient (although she did get completely naked Saturday night but didn’t want to have sex - confused me but it doesn’t matter). \n\nThere really isn’t an issue we’re just trying to rebuild emotional intimacy and I’d say things are going very well so far. The issue is we had plans prior to our fight to spend the 4th weekend together at her friends lake house. She hasn’t mentioned it to me since we’ve started talking. I’m sure it’s crossed her mind a"
    },
    "ai": {
      "title": "my (18m) girlfriend (19f) has recently been having issues with me not wanting to be exclusive with her. What can I do for her?",
      "text": "My girlfriend and I have been dating for over a year. We met when she was drunk and we've been seeing each other ever since. We have a good relationship. Unfortunately, we have yet to go through the honeymoon phase. She has never dated a guy before, so I was always her number one guy and I was her number one guy.\n\nFast forward to now and I am starting to feel like we're starting to get too serious, and I feel like I am taking her for granted.\n\nShe recently broke up with her ex, and because of her being a part time college student, she can't have anything that can really affect my schedule. She is a good person and I really love being with her, but I'm afraid of losing her.\n\nI really appreciate any advice that you have to offer.\n\n*UPDATE: Thanks for the support everyone. I am going to talk to her about this, as I am afraid of losing her. She will tell me how she feels, and when I tell her I am going to work it out with her. If she still has any issues I will have to get my ass to counse"
    }
  },
  {
    "subreddit": "hobbydrama",
    "human": {
      "title": "[Film Twitter] The Bechdel test and its (dubious) applications to modern media",
      "text": "Some rather amusing Film Twitter drama went down earlier this month, and it’s just the right mixture of low-stakes, high-drama nonsense that this sub should find amusing.\n\nFor those who don’t know, the **Bechdel test** is a term coined by a friend of popular comic artist Alison Bechdel, who created the comic strip “Dykes to Watch Out For” centered on a group of lesbian women. In 1985, [Bechdel published this strip](https://upload.wikimedia.org/wikipedia/en/b/bf/Dykes_to_Watch_Out_For_%28Bechdel_test_origin%29.jpg), outlining what would later become the foundation for the imaginary test. In order for a film to “pass” the so-called Bechdel test, it must satisfy three conditions:\n\n1. It must feature at least two female characters,\n\n2. who have at least one scene talking to one another,\n\n3. about something other than a man.\n\nThis is, of course, not a new concept in media, and it is theorized to have its origins in the essays of Virginia Woolf, which famously called out the misogyny and neg"
    },
    "ai": {
      "title": "[Fiction] People of the Past is a series of short stories and novels that follow a group of historians from the late 19th Centuries on various excursions.",
      "text": "[This is a fairly un-nuanced synopsis of the series if you haven't read all of the books yet](https://www.goodreads.com/series/120855-people-of-the-past). There are currently about 12 books in the series (and many more short stories and novels), plus a TV series by the same name set in the same world as the main ones.\n\nI have not much to add to the discussion of the series, as the books are really excellent but I am only familiar with the series through the TV show and not the books."
    }
  },
  {
    "subreddit": "math",
    "human": {
      "title": "How to develop “problem solving” skills to tackle a wide range of problems? Can one develop math competition level problem solving ability?",
      "text": "I’m a rising senior currently going through a book called the [“the green book”](https://usermanual.wiki/Document/Practical20Guide20To20Quantitative20Finance20Interview.604244935.pdf) which is essentially a book which is used to prepare for quantitative finance interviews. It includes a wide variety of interview questions that have common structure to them that many people have come across in quant interviews. The book includes concepts ranging from combinatorics puzzles to game theory to linear algebra and everything in between.\n\nNow as I have been going through this, the main hurdle I have just been facing and I’m realizing that I’m missing here in my math toolbox is “raw problem solving ability”. If I read a chapter on game theory, I could probably do some problems at the end of the chapter because I learned the problem solving strategy in the chapter. But given a random problem, I can’t help but realize I take the wrong approach every time. A problem which I thought was a combinato"
    },
    "ai": {
      "title": "I'm in high school. I have a math problem to solve but I'm not clear on the problem.",
      "text": "My dad and I were watching a math video online and I thought it would be fun to just solve the problem. So I went to the online calculator and typed in 4.8 and hit calculate. It said I didn't have enough experience to solve 6x5x4x3x2x1x0. I know you can't have enough experience, and I have about a hundred hours in the calculator.\n\nWhat's the correct answer?\n\nThanks!"
    }
  },
  {
    "subreddit": "offmychest",
    "human": {
      "title": "My little girl just had an anaphylactic reaction and I’m really mad",
      "text": "I’m not mad that she accidentally ingested her allergen.  It’s the first time we’ve ever slipped up and we followed our action plan and gave her the Epipen. \n\nI’m really mad because I had to convince my husband to take her to ED afterwards. \n\nIt shouldn’t be up for discussion right? Child has anaphylaxis. Give epipen to child. Take child to ED. \n\nThere’s no wiggle room there right?!?!? \n\nI feel like if I was the one to go to ED with her, then he wouldn’t say anything and would just drop us off and piss off home to sleep (it’s evening here). But because he has to go (I have to watch our other baby who’s still breastfeeding), he’s dragging his feet. \n\nHe’s gone now with our little girl but I’m still fuming"
    },
    "ai": {
      "title": "I'm so fucking tired of this fucking life",
      "text": "I don't belong to any club, I'm not a famous person, I don't have any friends, I don't have any family, I don't have any friends, I don't have any money, I don't have any family, I don't have any friends.\n\nSo many people around me that I want to fucking kill, but I can't, because I'm too fucking selfish to do it.\n\nI'm so fucking tired of doing my fucking job for no reason.\n\nI'm fucking tired of waiting for my fucking turn in life.\n\nI'm fucking tired of everyone fucking talking about how great a person I am, while I sit here thinking of how fucking awful that person is.\n\nI'm fucking tired of my fucking fucking job.\n\nI'm fucking tired of the fact that I'm not able to make my kids happy, because I can't just fucking be a fucking dad.\n\nI'm fucking tired of this fucking life."
    }
  },
  {
    "subreddit": "dota2",
    "human": {
      "title": "There should be a sound for when an item gets added to your inventory",
      "text": "Giving people items is a common tactic in high level games, giving bottle to your 4 when they tp mid, giving tango, dropping items for whoever just respawned so they can deliver them for you etc. However, the lack of sound effect or any form of notification makes these situations feel awkward and even unintentional as it's rare you are immediately aware an item even got added to your inventory. Pretty much anytime I give someone an item I have to ping it and remind them over voice that I've just given it to them.\n\nI think a simple non-intrusive sound effect similar to the chat sound would be a great addition to making players feel like this is something that should be taken advantage of, as opposed to just a remnant of how items worked in Warcraft 3 which is how it makes me feel right now. Additionally a sound for when items get dropped on the ground would be great for when you drop items from your stash for people who are in the fountain."
    },
    "ai": {
      "title": "A question for those who think they can't \"get to the pro scene\" in Dota 2",
      "text": "So a lot of people who are interested in getting to the pro scene want to start with Dota 2, and I know some of you are probably thinking they can do that playing a video game and then just practice for a year. I completely understand that, and you're right. But I'm asking for a different reason: I want to get to the pro scene. I want to play in a team and I want to play with pro people. I want to play with good friends, and to become a part of the pro scene.\n\nI'm asking what do you guys think is the best way to do that?"
    }
  },
  {
    "subreddit": "emojipasta",
    "human": {
      "title": "which is the better f̶a̶c̶e̶ o̶f̶ a̶ p̶e̶r̶s̶o̶n̶ b̶e̶i̶n̶g̶ h̶e̶l̶d̶ h̶o̶s̶t̶a̶g̶e̶ i mean emoji heheh yeah!",
      "text": "\n\n[View Poll](https://www.reddit.com/poll/vm2tyo)"
    },
    "ai": {
      "title": "I'll take two",
      "text": "I'll take two"
    }
  },
  {
    "subreddit": "askmen",
    "human": {
      "title": "What is considered \"initiating sex\"?",
      "text": "I often see men complaining about their partners not initiating, and even in my experience, when I thought I did, I was told I don't. So I'm confused about what it is that men consider initiation."
    },
    "ai": {
      "title": "If you are a woman who has had a child, how did your body react to giving birth in public?",
      "text": "I will ask this a number of different ways, I don't think there is a right or wrong answer."
    }
  },
  {
    "subreddit": "awakened",
    "human": {
      "title": "Kind of terrified even writing about this.",
      "text": "I'm not certain this belongs here, but after a long bout of Googling I came across some posts that seemed in the ballpark. Bear with me.  I've been going through something the past couple of years. It started with me leaving a religious cult that I was born into after 40 years.  In the time since I've embarked on a journey of deep research and exploration. To have one's iron-clad worldview suddenly torn down around you by your own hand is difficult enough. To be shunned by a literal lifetime of social networks is another layer altogether. But as a person who needs to understand the nature of my existence, I cannot simply leave a void behind where religion once occupied space.  I've enjoyed and been deeply affected by the words of Matias de Stefano in the past 3 months or so.  I stumbled upon a podcast wherein Matias was interviewed and relayed what he believes are memories of his previous existences, most notably that of a citizen of what we would now refer to as Atlantis.\n\nOk, still h"
    },
    "ai": {
      "title": "\"It's never too late to wake up\"",
      "text": "So, after reading many inspirational books and blogs throughout the past year, my new idea for 2018 is to work on making my life more enjoyable.\n\nI want to make sure to live my life in a way that is fulfilling.\n\nSo, now I have an idea for a book that will help me with my goal of living a fulfilling life.\n\nWhat am I going to write about, you ask?\n\nWell, I will talk about how to make life more enjoyable.\n\nWhat am I going to talk about?\n\nWell, I think that the main thing is that you need to start living in a way that is fulfilling to yourself.\n\nAnd if you do this, you will start to experience things in a way that is fulfilling to yourself.\n\nAnd I think that the more fulfilled you are, the more things you will experience.\n\nI have always had a goal to be fulfilling to myself, and I think that my book will help me achieve my goal.\n\nSo, the question is, what do you think?\n\nAre You Going to Work on Making Your Life More Enjoyable?"
    }
  },
  {
    "subreddit": "hobbydrama",
    "human": {
      "title": "[Movies] Morbius Sweep: How an Internet Meme Caused a Mediocre Superhero Movie to Bomb at the Box Office Twice",
      "text": "With the sheer number of superhero movies being released nowadays, it’s not uncommon to see one that focuses on one of a studio’s more obscure characters. One such film was [Morbius](https://m.imdb.com/title/tt5108870/?ref_=nv_sr_srsg_0), which follows the acclaimed biochemist Michael Morbius and how he gained vampire-like powers after attempting to cure himself of his rare blood condition. When the dust settled on his theatrical debut, his movie became an lesson on the importance of recognizing irony.\n\n#The Morb Awakens\n\nThe first serious talk of putting The Living Vampire on the big screen began in 2017, with plans [to include the character in Sony’s Spider-Man Universe](https://www.hollywoodreporter.com/movies/movie-news/spider-man-spinoff-morbius-living-vampire-movie-works-power-rangers-writers-1056702/). Production of Morbius’s standalone film began in 2018, with Daniel Espinosa as director and Jared Leto playing the titular Michael Morbius. After two years of production, the film"
    },
    "ai": {
      "title": "[Tumblr] An anonymous user creates a Tumblr blog about people who follow the social justice warrior movement",
      "text": "[The original post](https://old.reddit.com/r/TumblrInAction/comments/9i9s7y/tumblr_user_lady_fearon_has_published_unofficial/)\n\nIt includes a few links, apparently to tweets (which are apparently deleted due to copyright issues) and to actual tweets (which are not).\n\nIt's been [removed](https://old.reddit.com/r/TumblrInAction/comments/9i9s7y/tumblr_user_lady_fearon_has_published_unofficial/).\n\nThis post is here for the curious."
    }
  },
  {
    "subreddit": "drugs",
    "human": {
      "title": "Fuck heroin. Wish I never touched it.",
      "text": "I’ve been clean almost 3 years. Only used the shit for half a year. Feels like I permanently fucked my life. I’ve always been interested in shit like military, police, ems and such. Have always wanted a job like that since I’ve been a kid. Almost joined the marine corp when I was 18 but decided to not ship to boot camp because I wasn’t through with my relationship with weed. Little did I know that decision would lead to the isolation and loneliness that led me to use heroin. \n\n 2 1/2 years later. My head is screwed on straight and I wanna pick up where I left off. If only I knew 4 years ago I would be disqualifying myself from my dreams when I decided not to ship to boot camp. Now I have a detox/rehab visit on my records, me being prescribed Suboxone on there. It would be very hard/ almost impossible for me to ever to join the military again, definitely never apply for police, and probably can’t see ems/firefighting happening either. That shit took my dreams from me. Now I’m more isola"
    },
    "ai": {
      "title": "Anyone ever do a DMT trip and see the true nature of the universe?",
      "text": "I remember reading an article that said DMT is one of the top 5 psychedelic substances (or more accurately, top 5 psychedelic substances in the universe) due in large part to its ability to connect to the universe. While the universe may not necessarily require DMT, it does seem that it is something that could be connected to one's own experiences. \n\nIs DMT really the key to the universe?"
    }
  },
  {
    "subreddit": "vxjunkies",
    "human": {
      "title": "Please help! Problems with new hardware!",
      "text": "So, a couple days ago I tried installing my new 200Hex + VX Special Megalith-Core 3101 module into my PNN system config, which I've already modified with the 6032-Bit board from Oxxid, (yes, I know it's fairly old but works great BTW, better than other more recent competition out there) but my module was failing to attach. I tried my best, but not even my last-resource self-installer on my personal chip managed to do it. I called out for tech help on 200Hex's brainframe employee contact, but just got one of those crappy sentient bots, you know how it is. VX didn't do much either. Called my local repairman who worked just crossing the light bridge from the citadel I live in, best guy in the business I know. He managed to do it with his para-drill but when I turned the PNN system on, it reached 78 Krellsin degrees. Turned it off immediately and am now stuck... Anyone know what to do?? I'm using my old module ATM but would still appreciate some tips."
    },
    "ai": {
      "title": "[Xpost from r/pics] I made a VX module that's been giving me headaches",
      "text": "So this is my first time posting on this subreddit, and I want to thank you all for all your time and patience. I've been putting off posting this because I'm worried about how much of a mess I'm in. But I thought it was a good time. I'm so sorry for the length of this post. I just wanted you all to know that I was able to complete this mod.\n\nThe mod for this project was made for an M2-P module that I purchased from the third party VX Supplier. This mod makes use of my old M1-P and M4-P modules, and it has been giving me headaches. I've been working on this mod for a month, and it was finished in about two. I made some minor mechanical adjustments, and I feel so much better now. \n\nI'll be posting some pictures of this mod once it's done. It was a lot of work, and I appreciate all of your patience.\n\nI'll be able to post more information about this mod once the mod is done. I appreciate all the questions I've been getting about it. I have a lot of time to answer them when the mod is done"
    }
  },
  {
    "subreddit": "awakened",
    "human": {
      "title": "How going blind helped me to see clearly",
      "text": " \"With a sickle cell bleed we have no idea what we'll find. There could be scarring or a detached retina. We would usually advise that you just rest at home for a few weeks to see if it heals by itself, but as you are already blind in the other eye, that isn't practical. So we are going to operate but I just want you to know the risks.\"\n\n\"Gulp!\" I don't know if you can actually think the word \"gulp\" but if you can, I did.\n\nAt this point I had been blind for 6 days, since my sickle cell anaemia caused a mutant blood vessel to burst in my left eye.\n\nThe top eye doctor at the top eye hospital in the UK (and possibly the world) Moorfields, had just delivered the scary news that the operation may not work and I might be blind for good.\n\nThis was my moment of truth.\n\nA year ago I had lost the sight in my right eye because of a sickle cell bleed, which I didn't go to hospital for because it was the height of the Rona and I'm not a fan of coerced medical experimentation.\n\nI'm also not as ident"
    },
    "ai": {
      "title": "You can't be awakened",
      "text": "You can be awakened. You can be the new Buddha. \n\nBut if you're in this moment, you're not awakened. \n\nYou're alive, but not awakened. \n\nYou can be the new Buddha. You can be reborn. \n\nYou can be, but you are not the new Buddha. \n\nThe new Buddha is you. The rest of the world is you. \n\nYou are not the new Buddha. \n\nYou are awakened to yourself."
    }
  },
  {
    "subreddit": "vxjunkies",
    "human": {
      "title": "An update on the project I’m working on!",
      "text": "Hello VXJunkies! Second time posting here. Previous post was asking for help with a problem with my Sirrus generation core, turns out I just needed a relativistic converter! Thanks, u/jryser !  \n\nI finally bought the antigine clock, and combined it with my newly enhanced Sirrus generation core, and it worked like a charm! I now have an anti-semiphase conductor!  \n\nAs for the bigger project I mentioned in my previous posts, I’d like to keep that a secret for now, but all I’ll say is that it involves the second dimension."
    },
    "ai": {
      "title": "A question for the VX crowd",
      "text": "I have a VX-1 unit that has been sitting for a few months in the basement. The only issue is that the power supply can't keep up with the power input. \n\nThe original one was only about 10 watts. I replaced the power supply with a new one which is currently in the process of being assembled. I am now asking the question: is it possible for the original power supply to be replaced with a new one?\n\nI am not asking about the new power supply. I am asking about the old power supply. Can it be replaced with a new one? The VX-1 unit is a very old unit, and I am going to replace it with a new one soon. I am not sure what kind of new power supply I should use, but I know that the main board is about to get some serious heat and I am going to replace it with a new one. The rest of the VX-1 unit is working fine.\n\nThe VX-1 unit has been sitting here in the basement for a while now, and I am afraid that the power supply I have now will be inadequate to keep up with the power input. The old power su"
    }
  },
  {
    "subreddit": "copypasta",
    "human": {
      "title": "From belle delphine and twomads twitter post",
      "text": "belle!! you’re my queen, the love of my life, my burning passion and the reason i wake up every morning and go to bed every night 📷 please PLEASE let me get one ounce- no, one MILLILITER of your succulent delectable breast milk.. please belle 📷"
    },
    "ai": {
      "title": "I am so frustrated right now",
      "text": "I am so fucking frustrated right now my fucking head is spinning. My head is literally buzzing, my fucking brain is melting. I can't fucking function. I can't fucking think right now. My brain is just so fucking fucked up. I can't fucking think right now. I can't fucking function right now. My fucking brain is melting. I can't function right now. My brain is melting. I can't think right now.\n\nFUCK. FUUUCK. FUUUUUCK."
    }
  },
  {
    "subreddit": "lifeprotips",
    "human": {
      "title": "LPT: If you notice someone is sweating a lot, there is no need to mention it — they already know.",
      "text": "I don't know why people always feel the need to mention when someone else is sweating in a social situation. I can guarantee you, they are well aware of it and you letting them know isn't conducive and can actually make things worse. \n\n\nDon't be a dick."
    },
    "ai": {
      "title": "LPT: when youre having a hard time with a hard drive that is full it can be a good idea to pull out a few of the larger screws and use one on the other hard drive in the same computer.",
      "text": "I had a hard drive crash and I needed to save a photo to my phone and it just happened to be on my phone. I didn't lose any important data but I was unable to save that image since it would have been on the hard drive."
    }
  },
  {
    "subreddit": "prorevenge",
    "human": {
      "title": "Don't mess with an engineer",
      "text": "I worked for a company that provides specialised equipment used in manufacturing. (To protect my anonymity I'll have to be vague about what exactly this machine does.) During my time working in this field I got to know many clients who would need these machines installed and serviced. \n\nOne of these customers we'll call Jake. I later left the company to for a different job, but Jake apparently kept my number. \n\nOne afternoon I got a call from Jake that they wanted a new unit installing and another unit needed maintenance and wanted to know if I was available. I let him know that I left the company but that I could pass him on to someone who could help. He tells me he'll pay 2x my current rate to install the unit over the weekend. He lets me know that the company has increased the rates for installation and the company just can't afford it. The instructions they sent over just aren't clear enough and their engineers are scratching their heads trying to figure it out. He begs me to consi"
    },
    "ai": {
      "title": "Sick-Inequities of the American School system.",
      "text": "   This just happened in my school district. A bit of background - I was a grade 8 student and a bit of history behind me. I was very frustrated with how my parents were raising me and had been for quite some time. I had been bullied my whole life. \n\n  Now on to my revenge.\n\n  There is a small district in my school that I have never been to. This district has a reputation of being very bad. The district has the highest rate of bullying of any school in the district. I knew this as I was a bully myself. \n\n  Now onto the story:\n\n  We had to clean up after recess. My friends and I were the only ones that could do it and it was a mess. The janitor and I had to use a big bin that was next to the locker room and that is where we were cleaning up. I'm not sure what we were cleaning up but it was a lot of disgusting looking hair from some of the kids (I have no idea why - they were just too ugly to want to go to the bathroom). We also had to wash and scrub the floor every day. It was a huge me"
    }
  },
  {
    "subreddit": "fantheories",
    "human": {
      "title": "The Minions and Genghis Khan",
      "text": "So, it's canon that the minions served Genghis Khan. During Genghis Khan's Reign of Terror on Asia, he and his army had a lot of female partners (willing and unwilling) so many that most residents that live in Asia have at least a little bit of Genghis Khan's DNA. SO.. with that being said... If the minions served Genghis Khan... Did the minions..."
    },
    "ai": {
      "title": "[The Mummy]The evil mummy is a woman",
      "text": "I have a theory that the evil mummy, played by Jake Johnson, is actually a woman.\n\nThink about it. The evil mummy is wearing the female version of the \"Halloween mask\". \nThe evil mummy is also responsible for the kidnapping of John Logan. \nThe evil mummy is also responsible for the death of his son, Jack.\n\nHowever, I think that this theory is only true if you assume that the evil mummy has been in a physical relationship with Jack for years. If you just assume that the evil mummy is a man with a child, then the theory does not make sense. The evil mummy has been around for hundreds of years and has never held a physical relationship with a woman. \n\nMy theory also explains why the evil mummy has a grudge against Jack. \n\nWhat do you think?"
    }
  },
  {
    "subreddit": "fitness",
    "human": {
      "title": "Victory Sunday",
      "text": "**Welcome to the Victory Sunday Thread**\n\nIt is Sunday, 6:00 am here in the eastern half of Hyder, Alaska. It's time to ask yourself: What was the one, best thing you did on behalf of your fitness this week? What was your Fitness Victory?\n\n**We want to hear about it!**\n\n**So let's hear your fitness Victory this week! Don't forget to upvote your favorite Victories!**"
    },
    "ai": {
      "title": "What to do with excess body fat?",
      "text": "Hey /r/fitness. I've been working really hard to take my physique to a new level. I've been hitting the gym since January, but I have about 35 pounds of fat that I would like to get rid of before I start bulking. My diet is pretty good, I'm around the same weight as I was last year, and I've been eating about 2400 calories per day. I think if I cut the calories to just over 1900, I will lose about 12 pounds of fat and gain a bit of muscle. I'm a skinny guy, so I don't want to gain too much muscle. I was thinking of bulking with a caloric surplus, so I would like some advice on what to do with all that extra fat. Do I eat it off, or cut it? What do you guys think?\n\nI'm probably going to go buy some new shirts to fit better, but I'm really curious to hear your thoughts. Thanks for any advice that you can offer."
    }
  },
  {
    "subreddit": "rant",
    "human": {
      "title": "I want a work from home job so bad.",
      "text": "I'm jealous of all of you people who have a remote job. I'm 28 and I work as a security guard and I've mostly done blue collar jobs my whole life. Before security I worked at a computer repair shop as a unpaid intern and before that a cashier helping my dad at his store. So I am not so sure if I have any transferable skills for remote work.\n\nI would love to work remote since I'm so sick and tired of getting up at 5am, getting ready for a hour and a half, and being at my job. Plus, I don't have to look busy working at home. I can work on my laptop and have my PC running in the background I could do some light gaming, watch and web surf, or do some chores thought the day. That is if I get my work done early or if it's a slow work day. I read posts of people getting their work done in 3 hours and having the rest of the time to do what they want and get paid full time. I also get my own private bathroom, with a full 8 hour sleep, and I can cook better meals. Also I don't have to transfer a"
    },
    "ai": {
      "title": "You make a good point.",
      "text": "It's not about the money. It's about the health and safety of the children. If you can't respect that, you don't deserve to have kids."
    }
  },
  {
    "subreddit": "offmychest",
    "human": {
      "title": "I just got a vasectomy and I encourage other men to do the same.",
      "text": "I hesitated before getting one because I thought it would be painful, but I was wrong. It was a quick procedure, not too invasive and it barely hurt. I was numbed beforehand so I didn't feel anything really. I'm glad I went through with it. I no longer have to worry about unwanted pregnancies and my girlfriend can finally get a break from her birth control pills.\n\nI decided to get one because my girlfriend and I don't ever plan on having children, and when she tried to get a hysterectomy she was turned down by 3 different doctors and told she would change her mind. On top that her birth control pills were having a serious impact on her health so we both decided she'd stop taking them and I'd get a vasectomy instead. \n\nSo many guys whine about vasectomies because they are either uneducated about the procedure, or they're flat out selfish and expect their partners to take on the responsibility of contraception on their own. \n\nI encourage other men to get one too, vasectomies are effectiv"
    },
    "ai": {
      "title": "I am not over my ex or I'm a fool.",
      "text": "I know it's an unpopular opinion, but I'm sorry.\n\nI am not over my ex. She's a person I can't stand to see. I see her around and I want to punch her in the face. I know it's wrong. I know it's not worth it and I hate it. I know I'm wrong. I know it's wrong. I know I'm a fool. But what can I do? She's a monster. She's cruel. She's a sociopath. She's a lying bitch. She's a fucking monster. She's just selfish. She doesn't care about anyone but herself. She doesn't care about me. She doesn't care about our friends. She doesn't care about our family. Hell, she's even a fucking murderer and I want her to be punished for what she's done, but I'm afraid it's too late.\n\nIf I can't stop caring about her, I'm a fucking fool. \n\nI'm a fucking fool for feeling what I feel. I'm a fucking fool for caring about her. She's not worth it. She's not worth it. She's not worth it. She's not worth it. She's not worth it. She's not worth it."
    }
  },
  {
    "subreddit": "circlejerk",
    "human": {
      "title": "Just Unsubbed from Reddit because someone made fun of my country in a meme!",
      "text": "They made fun of Europe! Now I feel like a fat stupid American"
    },
    "ai": {
      "title": "DAE think that Ron Paul was a good candidate but he just wasn't an ideal candidate? Also, his campaign was too low energy",
      "text": "I am a [le]terally autistic [le]ditarian"
    }
  },
  {
    "subreddit": "zen",
    "human": {
      "title": "~ Baby Zen ~ (BCR, c.80)",
      "text": "^(()[^(A GreenSage OP)](https://greensage.fandom.com/wiki/GreenSage_Wiki)^)\n\n(Case 80 of the Blue Cliff Record)\n\n&nbsp; \n\n\n***\n***\n\n>>## A monk asked ZhaoZhou, \"Does a newborn baby also have the sixth consciousness? \"\n>>\n>>## ZhaoZhou said, \"(Like) tossing a ball on swift-flowing water.”\n>>\n>>\n>>## The monk also asked TouZi, \"What is the meaning of 'Tossing a ball on swift-flowing water'?” \n>>\n>>## TouZi said, \"Moment to moment, nonstop flow.\"  \n\n\n***\n***\n\n\n&nbsp; \n\n\nThis is a reference to the [\"eight consciousnesses\".](https://en.wikipedia.org/wiki/Eight_Consciousnesses)\n\nAccording to my basic research on this topic, there is a shared tradition between the various Indo-Buddhist traditions of the six \"consciousnesses\" which correspond to the five senses plus a sixth sense of mental consciousness or awareness. This is probably what we, in the West, typically refer to with the term \"consciousness\" itself.\n\nIt would seem that the [Yogachara](https://en.wikipedia.org/wiki/Yogachara) school"
    },
    "ai": {
      "title": "The Great Way is not difficult for those who have no preferences.",
      "text": ">The old master of the monastery said, \"Once I was sitting in meditation, and then the rain came, and the sky turned orange. Then I said to myself, 'This is the Great Way, but I have no preference.' Thereupon I heard the sound of the rain on the roof. Then it was over.\n\n>Then I heard the sound of the rain on the roof again, and it was over. Then I heard the sound of the rain in the grass. Then it was over.\"\n\n- Dogen Zenji (1890-1953)"
    }
  },
  {
    "subreddit": "copypasta",
    "human": {
      "title": "god asked me if I wanted to beta test meth 2 and I said yes | S1 EP1: new home",
      "text": "Peppa pig and her family arrive to their new home in Florida after their old house was shelled to oblivion by the Austro-Hungarians during ww1 .the arrive to their new house and their new neighbors immediately introduce themselves , Samuel Rodriguez and Light Yagami. After Peppa and her family unload their 13 kilograms of crystal meth into their house , they start exploring to get familiar to their family . whey are also packing 20 pounds of explosives incase someone breathes slightly wrong because why not. while they are strolling through the park , george pig finds some bugs that he can brutally torture and kill, so he keeps them in his cum sock for safe keeping. after that daddy pig then procedes to shoot-up a local school but its okay because he was wearing a mask . while they are exploring they also meet the state senator , quadingle dingle. Daddy pig and quadingle dingle have a nice conversation about the social economics of the state , conversation highlights:\n\n(DP = daddy pig) "
    },
    "ai": {
      "title": "What's with the weirdly specific flair?",
      "text": "What's with the weirdly specific flair? I am a fan of the show, and I want to know, what's that about?\n\nIf I understand you correctly, there are only two possibilities:\n\n* You have a fetish for anal sex, and you have a hard on for anal sex.\n\nOr\n\n* You have a fetish for anal sex, and you masturbate to anal sex, and you have a hard on for anal sex. \n\nThis is an extremely weird fetish. If any of you are into this, I can understand your desire for the second."
    }
  },
  {
    "subreddit": "offmychest",
    "human": {
      "title": "I stopped a suicide attempt today, and it traumatised me",
      "text": "TW: for suicide ig \n\nAfter school, I was at a train station, and a man was standing on the tracks.\n\nHe seemed sad. \n\nMy anxious part of me triggered, \"He's gonna jump onto the tracks\" \n\nI approached him and asked if he was ok and he said no. He said he lost everything and he now has \"nothing\". He explained how he lost his job. I told him that everything will be alright and this was not the right option.\n\nI have autism, and empathy is something I struggle with. I didn't know what to do. I have self-harmed in the past, and been to a therapist. I told him what my therapist said to me, and said that its never too late, and even one person is still there for you. I told him the world was a fucked place, but it won't get better with more death.\n\nThe train came and he didn't jump. He said thank you and walked up the escalator.\n\nI don't know if I should post this. I have friends who see this, and the story just seems so clichè. \n\nI don't know what to do. Everything is just so overwhelming."
    },
    "ai": {
      "title": "My father has cancer and has been in the hospital for 2 days. And I'm so sad.",
      "text": "My dad has been hospitalized for two days. He's on chemo and radiation. \n\nHe's really strong. He can't work and I'm the only one he can depend on. \n\nI'm glad he's here, I feel a bit sad and a bit lost.\n\nI've never lost a sibling or parent in my life. And I'm so sad. I can't hold it in and I'm crying. It's fucking terrible."
    }
  },
  {
    "subreddit": "iama",
    "human": {
      "title": "Chloe Traicos who plays Gloria Freeman on The Righteous Gemstones would love to talk to you all about the show",
      "text": "Chloe Traicos - I'm an actress who plays Gloria Freeman on The Righteous Gemstones. In the most recent season I'm known for being Harmon's mother and  the wife who was cruelly abandoned in the pet store,and whose son Harmon grows into Macauley Culkin's character who goes on to do some pretty bad things as the season progresses.\nGloria has sparked a great deal of online discussion and theories about what happens to her and Harmon - And I'd love to answer any questions you all may have about the character and about being on the show.\n\nProof: [Here's my proof](https://postimg.cc/qgLH9bRq)!\n( horrible picture but hopefully you can at least see its me)"
    },
    "ai": {
      "title": "IamA (Porn Star) AMA!",
      "text": "I am a pornstar, I was the first girl to do porn in the US and the first girl to do porn in a non-domestic country.\n\nI will answer anything about the industry, my past, the industry, my current job, my personal life, and anything else you would like to know! \nI will answer this AMA any time between now and tonight. \n\nI am also open to questions on my current job and my personal life, so feel free to ask anything there.\n\nProof (pornstars.com profile) is needed. I am also open to private messages.\n\nProof:\nhttp://imgur.com/a/6Gd5Y\nhttp://imgur.com/0D4jXoN"
    }
  },
  {
    "subreddit": "asoiaf",
    "human": {
      "title": "How should catelyn have handled the Tyrion situation (spoilers main)",
      "text": "While I don’t blame Catelyn for the war, I do think that her kidnapping Tyrion was the breaking point. What should she have done"
    },
    "ai": {
      "title": "(Spoilers All) Why do some people love the TV show and others hate it?",
      "text": "I've always been curious for people to explain why some people love the show and some people hate it. \n\nI have a few reasons for liking the show, but I'd like to hear some other people's thoughts as well.\n\nI'm wondering if these people have any other reasons for liking the show, or if you think there is any other reasons they hate the show."
    }
  },
  {
    "subreddit": "offmychest",
    "human": {
      "title": "My little girl just had an anaphylactic reaction and I’m really mad",
      "text": "I’m not mad that she accidentally ingested her allergen.  It’s the first time we’ve ever slipped up and we followed our action plan and gave her the Epipen. \n\nI’m really mad because I had to convince my husband to take her to ED afterwards. \n\nIt shouldn’t be up for discussion right? Child has anaphylaxis. Give epipen to child. Take child to ED. \n\nThere’s no wiggle room there right?!?!? \n\nI feel like if I was the one to go to ED with her, then he wouldn’t say anything and would just drop us off and piss off home to sleep (it’s evening here). But because he has to go (I have to watch our other baby who’s still breastfeeding), he’s dragging his feet. \n\nHe’s gone now with our little girl but I’m still fuming"
    },
    "ai": {
      "title": "I have a crush on a guy",
      "text": "I've never been attracted to guys, but I have a crush on this guy, he's my friend and a lot of us are friends. I feel like I have to keep this a secret because it's so obvious. He's so cute, so funny, so friendly, and he's funny too. It's so simple to say that I have a crush on him, but no one knows about it so I have to keep it a secret."
    }
  },
  {
    "subreddit": "christianity",
    "human": {
      "title": "Was Told For 3 Decades That I Would Be Persecuted For My Beliefs. The persecution never came. I've Been Working With An LGBTQ Organization for 1 Month And We're Already Planning Safety Protocols After Fellow Volunteers Experienced Violence, Threats, and Doxing.",
      "text": "[The evangelical persecution complex](https://www.theatlantic.com/national/archive/2014/08/the-evangelical-persecution-complex/375506/) is real, and many I call brothers and sisters in Christ are the persecutors. Using God to excuse themselves of their own wrongdoings. rather than look at their own hearts when in prayer, worship, and reading God's word. With the wrongdoings unchecked, they are either cruelly indifferent at best, or violent aggressors at worse.\n\nThey rather, off-the-cuff, accuse whoever they disagree with in the church as infiltrators rather than even hear what another person has to say.\n\nAnyways. The event I was planning is going ahead this week, and it's free at the door, welcoming all to come. The church I attend (for now) is having an event the following day with a $18 cover charge and it is being held at someone's private helicopter hanger. Please tell me I'm not crazy in what I'm observing here."
    },
    "ai": {
      "title": "How do you make your own church?",
      "text": "I'm so happy to be in a new church, but I'm still having a hard time coming to terms with the fact that I don't know how to make a church. \n\n​\n\nI've been listening to a lot of podcasts and I've been doing some research, and I've come to the conclusion that making a church is all about the pastor. The church community needs to be able to support and teach the pastor. \n\n​\n\nHow do I decide who is the best candidate to become the pastor? How do I decide who is going to be the pastor? How do I choose a congregation? How do I choose a congregation?\n\n​\n\nI've been looking at a lot of different churches, and I've gone with one that I feel is the best fit for me. My questions are:\n\n​\n\n1. Is there a church that I am qualified to be the pastor?\n\n2. How do I know if a congregation is the right fit for me?\n\n3. How do I choose a congregation?\n\n4. How do I choose a congregation?\n\n​\n\nThanks in advance for your help. \n\n​\n\n​"
    }
  },
  {
    "subreddit": "vxjunkies",
    "human": {
      "title": "Help, my submodular depolarizer's nano-actuators keep overheating and I don't know why",
      "text": "Before anyone asks, I checked the quantum metastabilizers."
    },
    "ai": {
      "title": "Fatal Error: Cannot Connect to Server.",
      "text": "Any help would be greatly appreciated, thanks :)"
    }
  },
  {
    "subreddit": "tipofmytongue",
    "human": {
      "title": "[TOMT] [MOVIE][2010s] Monologue/dialogue where a character says something along the lines of \"you gave a dying/old man a lot of joy in his final days, and that is something I can never forget\"",
      "text": "This quote popped into my head, but I have absolutely no idea where it is from and searching it on google isn't much help. Very iffy on the time period— it could also be a TV show. I can kind of just hear the actor's voice in my head saying this. Sorry for this being incredibly, incredibly, incredibly vague! Any help would very much be appreciated."
    },
    "ai": {
      "title": "[TOMT] [MOVIE] Looking for a sci-fi film from the 70's and 80's in which a couple is on a ship together.",
      "text": "I saw this movie in the late 80s or early 90s. It was about a couple(? no) on a spaceship who are separated from the rest of the passengers. I think they're on a ship and somehow they end up on a deserted planet, and the ship is malfunctioning and they're stuck. And they end up finding a new couple who have found the exact same ship and they're on the ship too. \n\nThe couple is a man and a woman, they're separated for a couple of years and they get married and live together on the deserted planet. And the ship gets damaged and they have to leave the planet. \n\nI'm pretty sure it is a sci-fi movie, and the space is very alien to them, I remember it being a very alien setting that was reminiscent of \"Aliens\". So they end up having a very different view of life on Earth from the rest of the passengers on the ship.\n\nI'm pretty sure it's a comedy movie, and I remember the first scene is when the man in the astronaut suit is walking to the window of his bedroom and he's about to jump out when "
    }
  },
  {
    "subreddit": "awakened",
    "human": {
      "title": "The greatest hobbies...",
      "text": " \n\n**A great hobby is something that gives you quality time with yourself, and in this time you may ponder your feelings and thoughts more intimately.  Because sometimes life gets too busy for us to ponder like this, hobbies are a wonderful source for making friendship with ourselves.**  \n\n**I find my writing, my painting, my drawing quite liberating; because it is what gives me pride, joy, self-discipline, and a sense of freedom and time to discover myself.  And discovering ourselves is why we are alive, why we experience joy and misery, why we have the gift of self-awareness.**\n\n&#x200B;\n\n&#x200B;\n\n\\#hobbies #timewithyouself #greatestfriendship #selfdiscipline #selfawareness"
    },
    "ai": {
      "title": "How to become more awake",
      "text": "I hope this doesn't sound like a rant, it's actually very nice to write this down. I'd say I've been awakened for 5 years now, but I've just been sitting on my ass most of the time working and just doing nothing. \n\n​\n\nI'm not sure if it's something I'm doing, or if it's something I'm doing that I'm not aware of. I really want to know what you all think, if you have been in a similar situation.\n\n​\n\nI'm not even gonna say that I have any enlightenment to give, but I just want to write down my experiences of the past 5 years.\n\n​\n\nBasically, I'm still going through stages of enlightenment, but they're getting more and more intense. It's not like I used to be this enlightened, I'm still not this enlightened, but it's getting to the point where I don't even know anymore. \n\n​\n\nMaybe I'm using this wrong, but for example, I use to be a very big guy, 6'3\", 230 pounds. Now, I'm kind of an average size, about 5'8\" 160, and when I was eating a ton of junk food, I was getting really good at eating "
    }
  },
  {
    "subreddit": "whowouldwin",
    "human": {
      "title": "Every human on Earth is combined into a Human Kaiju as large as our combined biomass. Can the composite human kaiju take down modern Godzilla? w",
      "text": "If every human on the planet were combined into a human-shaped Kaiju, how powerful would it be? \n\nThe Human Kaiju is made of the combined biomass of the entire human population. It is shaped like a human. It does not have the combined strength, speed, durability, or whatever other stats besides weight and size and the ability to function like a movie Kaiju. It is roughly as smart as an average human. Would this composite human Kaiju be able to take down modern Legendary Godzilla or some other modern Kaiju? \n\n***\n\n- **Round 1:** Human race kaiju versus any of the Category IV Kaiju from Pacific Rim\n\n- **Round 2:** Human race Kaiju versus GvK Kong\n\n- **Round 3:** Human kaiju versus GvK Godzilla"
    },
    "ai": {
      "title": "Your favourite character(s) is fighting an unstoppable force. Who wins?",
      "text": "Which character has the best chance of victory? The one with the most firepower, the strongest army, the best weaponry, the best strategy, the most skill, the best tactics and the most experience?"
    }
  },
  {
    "subreddit": "jokes",
    "human": {
      "title": "I got fired from my job today for having sex at work.",
      "text": "My boss reamed me out and I said, \"What was I supposed to do, she was just lying there naked!\"\n\nHe shouted, \"The autopsy! The fucking autopsy!\"\n\nThen he fired me and called me the worst Veterinarian ever."
    },
    "ai": {
      "title": "I don't know if it's a joke, but I've always found it funnier to say \"I didn't know\" rather than \"I didn't know what\".",
      "text": "It's a little different, and a bit funnier. There's more ambiguity as to whether the joke is supposed to be obvious or not."
    }
  },
  {
    "subreddit": "offmychest",
    "human": {
      "title": "People who voted Republican in 2016 are directly responsible for the women’s rights regression in the US.",
      "text": "Whether you changed your mind, decided to vote Democrat or « came to your senses » is irrelevant. \nI saw one admin of a feminist page proudly telling her followers that her husband no longer voted for Trump. Who cares when people like him destroyed a fundamental right for women? \nI hope my Canada will hold on against the theocratical craziness."
    },
    "ai": {
      "title": "I lost my last job at an insurance company.",
      "text": "It's been a rough few months. After nearly 3 years, I got to the point where I couldn't do anything to help the company and I was losing my self confidence with my job. I'd give anything for a better job, but to no avail. I've been applying for jobs for almost 2 years now. I was just told by some people I interviewed with that I was hired in the last few months to replace someone who was let go for \"being too good\" or some shit like that. That was a big blow to the ego, I know. So I'm starting to take a step back from everything, and I would love for some advice on what to do the next few months.\n\nI was looking for a job before the new hires started. I was really lucky because the first person I talked to was a manager who I ended up becoming friends with. He said he was really excited about the new group and that they were going to do some really good things, so I went in for an interview. \n\nI was interviewed right after, and I ended up getting hired on my first day, which is great. I"
    }
  },
  {
    "subreddit": "prorevenge",
    "human": {
      "title": "Don't mess with an engineer",
      "text": "I worked for a company that provides specialised equipment used in manufacturing. (To protect my anonymity I'll have to be vague about what exactly this machine does.) During my time working in this field I got to know many clients who would need these machines installed and serviced. \n\nOne of these customers we'll call Jake. I later left the company to for a different job, but Jake apparently kept my number. \n\nOne afternoon I got a call from Jake that they wanted a new unit installing and another unit needed maintenance and wanted to know if I was available. I let him know that I left the company but that I could pass him on to someone who could help. He tells me he'll pay 2x my current rate to install the unit over the weekend. He lets me know that the company has increased the rates for installation and the company just can't afford it. The instructions they sent over just aren't clear enough and their engineers are scratching their heads trying to figure it out. He begs me to consi"
    },
    "ai": {
      "title": "Came back to this subreddit after some time away.",
      "text": "So I've only been on reddit for a little over a month but had a lot of fun and learnt a lot about my favorite game! \n\nSo today I received a message from my old friend who I haven't seen for about 9 months (because he moved to another branch) of which he wants to talk to me. He also added me on steam, this was a bit of a surprise. I had no idea he was on there. He's a very good friend and this is something I've wanted to talk to him for a long time. I was actually hoping he'd message me when he's off work but I got him on steam, so I'm sure he got there first thing in the morning. \n\nAnyway, I'm super excited, because this has been on my mind for a while. I'm thinking about buying that game again, so we have a good game to play together! I'm also playing through Kingdom Come Deliverance again, and I had a great time. I had a lot of fun in that game and I have been craving for an RPG like this one. I've also been looking for a way to get him to play this game again and he'd never played i"
    }
  },
  {
    "subreddit": "chess",
    "human": {
      "title": "The Nakamura vs Caruana match was one of the most entertaining games I have ever seen",
      "text": "The entire game just hinged on all expenses of the thrill: \n\nCaruana reaching time pressure and overcoming every time, \n\n Hikaru finding the wierdest of engine moves,\n\n Caruana having the picture perfect idea, only to land his rook one square short (e6 instead of e5),\n\nHikaru choosing the most human move illiciting the most insane of comebacks with Fabiano's Rh1 intent\n\nOnly for Fabi to not find that and curb expectations\n\nFollowed by Hikaru's wearing of the dreaded coat\n\nFollowed by a sudden mate threat was available for Caruana\n\nFollowed by Hikaru taking off the coat when things got tense\n\nFollowed by Caruana not seeing Rh1\n\nThen came a surprising nuance of repetition, removed by one simple Re4 move.\n\nMan, this game felt deserving of a celebration. That was a world-class display of strength of play and heart. What beautiful positional play, what thrill, what chess. A modern game banger"
    },
    "ai": {
      "title": "Anyone want to start a new chess club in my area?",
      "text": "I've been looking for a place to start a chess club in my area for a while now.  I want to have some sort of group for new players to learn the game.  I feel like this would be a good place to start.  I'm willing to be a little involved in the organization and would like to create a nice social environment.  What do you guys think?"
    }
  },
  {
    "subreddit": "sex",
    "human": {
      "title": "Have any other hetero women's libido in red states taken a complete nose dive since Roe on Friday?",
      "text": "I feel badly for my partner, but I feel like I'm in a state of grief and I can't shake it. I feel repulsed by men's silence and lack of concern for the situation. I'm upset that my partner isn't as upset as I am. I know that's not fair, but I don't even want to talk to other people that aren't feeling the same grief I feel. \n\nIs anyone else struggling with this like I am? I want to feel less alone."
    },
    "ai": {
      "title": "Does anyone else experience extreme cravings?",
      "text": "I'll be the first to admit that I'm not a very experienced crier, but I've been craving sex every day for the past 6 weeks. Is this normal/normal to crave sex on a daily basis?"
    }
  },
  {
    "subreddit": "tipofmytongue",
    "human": {
      "title": "[TOMT][word] Journalism: the word for leaving out verbs in sentences",
      "text": "example:\n\n- Police [are] searching for the suspect\n- Drivers [are] baffled about the new traffic signage\n- Congress [is] debating a tax holiday\n- Suspect [is] seen on camera defacing campaign signs\n\nabout 15 years ago (was when I first noticed) reporters started talking like this, leaving out the words above that I put in [ ] . I'm not really sure about newspapers, because headlines are always limited by space. But maybe the same term applies to them too. \n\nHonestly I don't even know if there's a word for this. Personally I dont like it, but I need to know what it's called first so I can research it more. Thanks in advance if you know!"
    },
    "ai": {
      "title": "[TOMT] Song with something like \"I got me a girl, she's my girl\" but I can't remember it.",
      "text": "I only know the chorus of the song and the last line is \"I got me a girl, she's my girl\". It's a rap song."
    }
  },
  {
    "subreddit": "whowouldwin",
    "human": {
      "title": "Could anyone from DC Comics, other than the Presence, defeat Kindred from League if Legends?",
      "text": "From what I understand, Kindred is the true personification of Death and not even being like Zoe and Sol can escape him. Anything that exists will some day succumb to his power. Everything will one day die. Can anything truly compete with all that? I know that Lucifer has done this and that and blah blah but in my honest opinion, I think that Kindred is an OP character."
    },

    "ai": {
      "title": "Kirby vs. Shrek",
      "text": "Kirby has to defeat Shrek's minions. Shrek can't use anything that would kill Kirby."
    }
  },
  {
    "subreddit": "wallstbets",
    "human": {
      "title": "[Free $25, free Spotify and 2% cashback] Crypto.com Visa Debit card",
      "text": " \n\nSo I tested [Crypto.com](https://crypto.com/) and wanted to make my own opinion about it:\n\nCrypto.com offers Visa debit cards that give 2% cashback and a range of other perks like free Spotify. This is a very big company. Recently [they started a huge ad campaign starring Matt Damon](https://www.youtube.com/watch?v=9hBC5TVdYT8) and they [bought the naming rights to the Staples Center in L.A. for 20 years](https://www.latimes.com/business/story/2021-11-16/crypto-staples).\n\nThe Ruby Steel card tier offers a **$25 instant bonus, free Spotify and 2% cashback on all purchases,** and a premium metal card. To get the card you need to stake €350 worth of CRO coins and hold it for 6 months. After this time you're free to sell them again (or keep if you want to retain the card benefits).\n\n**Important note:** you don't need to put crypto on the card, you can just load it with Euro or USD and spend it!\n\nAll cashbacks and bonuses are paid in the CRO cryptocurrency. You can immediately sell the C"
    },
    "ai": {
      "title": "DOW to the Moon",
      "text": "I know I'm late for the party, but a DD on the next major dip to check my DD's are always nice."
    }
  }
]